УРВ_файловая/src/Documents/БлокировкаЗаписиНаЛК/БлокировкаЗаписиНаЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БлокировкаЗаписиНаЛК</name>
  <registerRecords>InformationRegister.РасписаниеКонсультаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаБлокировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Работы</types>
    </type>
  </attributes>
  <attributes>
    <name>Замещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

УРВ_файловая/src/Documents/БлокировкаЗаписиНаЛК/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПодобратьИзРасписания(Команда)
	ДатаРасписания = НачалоДня(Объект.ДатаВремяНачала);
	Если Не ЗначениеЗаполнено(ДатаРасписания) Тогда
		ДатаРасписания = НачалоДня(Объект.Дата);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаРасписания) Тогда
		ДатаРасписания = НачалоДня(ТекущаяДата());
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата"				, ДатаРасписания);
	ПараметрыФормы.Вставить("Сотрудник"			, Объект.Сотрудник);
	ПараметрыФормы.Вставить("ДатаАктуальности"	, Объект.Дата);
	ПараметрыФормы.Вставить("ДокументСсылка"	, Объект.Ссылка);
	
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьИзРасписанияЗавершение", ЭтаФорма);
	//ОткрытьФорму("Документ.БлокировкаЗаписиНаЛК.Форма.ФормаПодбораРасписания", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ДополнительныеПараметры = Новый Структура;
	ИмяФормыДляОткрытия = "Документ.БлокировкаЗаписиНаЛК.Форма.ФормаПодбораРасписания";
	БоР_ОбщийМодульКлиент.ОткрытьБлокирующуюФорму(ЭтаФорма, ИмяФормыДляОткрытия, ПараметрыФормы, "ПодобратьИзРасписанияЗавершение", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзРасписанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураВозВрата = Результат;
	Если ТипЗнч(СтруктураВозВрата) <> Тип("Структура") Тогда
		ВозВрат;
	КонецЕсли;
	
	Объект.Сотрудник			= СтруктураВозВрата.Сотрудник;
	Объект.ДатаВремяНачала		= СтруктураВозВрата.ДатаВремяНачала;
	Объект.ДатаВремяОкончания	= СтруктураВозВрата.ДатаВремяОкончания;
	Объект.Продолжительность	= СтруктураВозВрата.Продолжительность;

КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяНачалаПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяНачалаПриИзменении(Объект.ДатаВремяНачала, Объект.ДатаВремяОкончания, Объект.Продолжительность, "ДатаВремяНачала", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяОкончанияПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ДатаВремяОкончанияПриИзменении(Объект.ДатаВремяНачала, Объект.ДатаВремяОкончания, Объект.Продолжительность, "ДатаВремяОкончания", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.УРВ_ПродолжительностьПриИзменении(Объект.ДатаВремяНачала, Объект.ДатаВремяОкончания, Объект.Продолжительность, "Продолжительность", "Объект", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеФДПриИзменении(Элемент)
	БоР_ОбщийМодульКлиентСервер.ЗавернутьФорматированныйДокументВ_XML(ОписаниеФД, Объект.ОписаниеXML);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БоР_ОбщийМодульКлиентСервер.РазвернутьФорматированныйДокументИзXML(Объект.ОписаниеXML, ОписаниеФД, , );
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	БоР_ОбщийМодульКлиентСервер.РазвернутьФорматированныйДокументИзXML(Объект.ОписаниеXML, ОписаниеФД, , );
КонецПроцедуры
